In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('cleaned_works.csv',index_col= 0)
df

,Title,Artist,Nationality,BeginDate,EndDate,Gender,Date,Department
0,Dress MacLeod from Tartan Sets,Sarah Charlesworth,American,1947.0,2013.0,Female,1986,Prints & Illustrated Books
1,Duplicate of plate from folio 11 verso (supple...,Pablo Palazuelo,Spanish,1916.0,2007.0,Male,1978,Prints & Illustrated Books
2,Tailpiece (page 55) from SAGESSE,Maurice Denis,French,1870.0,1943.0,Male,1968,Prints & Illustrated Books
3,Headpiece (page 129) from LIVRET DE FOLASTRIES...,Aristide Maillol,French,1861.0,1944.0,Male,1968,Prints & Illustrated Books
4,97 rue du Bac,Eugène Atget,French,1857.0,1927.0,Male,1903,Photography
...,...,...,...,...,...,...,...,...
16720,Oval with Points,Henry Moore,British,1898.0,1986.0,Male,1968,Painting & Sculpture
16721,"Cementerio de la Ciudad Abierta, Ritoque, Chile",Juan Baixas,Chilean,1942.0,NaN,Male,1975,Architecture & Design
16722,The Catboat,Edward Hopper,American,1882.0,1967.0,Male,1922,Prints & Illustrated Books
16723,Dognat' i peregnat' v tekhniko-ekonomicheskom ...,Unknown,Nationality Unknown,NaN,NaN,Gender Unknown,1931,Prints & Illustrated Books
16724,Plate (page 11) from The Dive,Alex Katz,American,1927.0,NaN,Male,2011,Prints & Illustrated Books

In [3]:
df.head(3)

,Title,Artist,Nationality,BeginDate,EndDate,Gender,Date,Department
0,Dress MacLeod from Tartan Sets,Sarah Charlesworth,American,1947.0,2013.0,Female,1986,Prints & Illustrated Books
1,Duplicate of plate from folio 11 verso (supple...,Pablo Palazuelo,Spanish,1916.0,2007.0,Male,1978,Prints & Illustrated Books
2,Tailpiece (page 55) from SAGESSE,Maurice Denis,French,1870.0,1943.0,Male,1968,Prints & Illustrated Books

In [4]:
df.shape  # How many rows & columns,in the form of Tuple Data Structure

(16725, 8)

In [5]:
print("Total rows: ",df.shape[0])
print("Total cols: " ,df.shape[1])

Total rows:  16725
Total cols:  8

In [6]:
df["Nationality"] = df["Nationality"].str.replace("(","").str.strip(")")

In [7]:
df["Gender"] = df["Gender"].str.replace("(","").str.strip(")")

In [8]:
df

,Title,Artist,Nationality,BeginDate,EndDate,Gender,Date,Department
0,Dress MacLeod from Tartan Sets,Sarah Charlesworth,American,1947.0,2013.0,Female,1986,Prints & Illustrated Books
1,Duplicate of plate from folio 11 verso (supple...,Pablo Palazuelo,Spanish,1916.0,2007.0,Male,1978,Prints & Illustrated Books
2,Tailpiece (page 55) from SAGESSE,Maurice Denis,French,1870.0,1943.0,Male,1968,Prints & Illustrated Books
3,Headpiece (page 129) from LIVRET DE FOLASTRIES...,Aristide Maillol,French,1861.0,1944.0,Male,1968,Prints & Illustrated Books
4,97 rue du Bac,Eugène Atget,French,1857.0,1927.0,Male,1903,Photography
...,...,...,...,...,...,...,...,...
16720,Oval with Points,Henry Moore,British,1898.0,1986.0,Male,1968,Painting & Sculpture
16721,"Cementerio de la Ciudad Abierta, Ritoque, Chile",Juan Baixas,Chilean,1942.0,NaN,Male,1975,Architecture & Design
16722,The Catboat,Edward Hopper,American,1882.0,1967.0,Male,1922,Prints & Illustrated Books
16723,Dognat' i peregnat' v tekhniko-ekonomicheskom ...,Unknown,Nationality Unknown,NaN,NaN,Gender Unknown,1931,Prints & Illustrated Books
16724,Plate (page 11) from The Dive,Alex Katz,American,1927.0,NaN,Male,2011,Prints & Illustrated Books

## ***How we can display column from the Dataframe***

In [9]:
df.columns

Index(['Title', 'Artist', 'Nationality', 'BeginDate', 'EndDate', 'Gender',
       'Date', 'Department'],
      dtype='object')

In [10]:
print(df.columns.values.tolist())  # Display all the columns in the form "list data structure"

['Title', 'Artist', 'Nationality', 'BeginDate', 'EndDate', 'Gender', 'Date', 'Department']

In [11]:
df.columns.values

array(['Title', 'Artist', 'Nationality', 'BeginDate', 'EndDate', 'Gender',
       'Date', 'Department'], dtype=object)

In [12]:
df.keys()

Index(['Title', 'Artist', 'Nationality', 'BeginDate', 'EndDate', 'Gender',
       'Date', 'Department'],
      dtype='object')

#### ***Want to access First to three column***(Slicing Concept)

In [13]:
df.columns.values[0:3]

array(['Title', 'Artist', 'Nationality'], dtype=object)

#### Want to 'Reverse' all the column ( Concept of 'LIST Slicing')

In [14]:
df.columns.values[::-1]

array(['Department', 'Date', 'Gender', 'EndDate', 'BeginDate',
       'Nationality', 'Artist', 'Title'], dtype=object)

## ***How to get 'INDEX' from the Dataframe***

In [15]:
df.index.values

array([    0,     1,     2, ..., 16722, 16723, 16724], dtype=int64)

##### INDEX means want to access the "ROWS OF THE DataFrame"

#### Want to get 'First Ten' INDEX

In [16]:
df.index.values[:10]

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [17]:
for i in df.index.values[:30]:  # Applying a loop
    print(i,end=",")

0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,

In [18]:
# How to get the data based on 'Even Row'

df[0:len(df):2]  # Data showing Based on Even Rows

,Title,Artist,Nationality,BeginDate,EndDate,Gender,Date,Department
0,Dress MacLeod from Tartan Sets,Sarah Charlesworth,American,1947.0,2013.0,Female,1986,Prints & Illustrated Books
2,Tailpiece (page 55) from SAGESSE,Maurice Denis,French,1870.0,1943.0,Male,1968,Prints & Illustrated Books
4,97 rue du Bac,Eugène Atget,French,1857.0,1927.0,Male,1903,Photography
6,Rue de l'Hôtel-de-Ville,Eugène Atget,French,1857.0,1927.0,Male,1924,Photography
8,Why Defy from Disasters of Peace,Diane Victor,South African,1964.0,NaN,Female,2001,Prints & Illustrated Books
...,...,...,...,...,...,...,...,...
16716,Untitled (Heat/Gun),Marco Breuer,German,1966.0,NaN,Male,1999,Photography
16718,High Peak,Matthew Rackham Barnes,American,1880.0,1951.0,Male,1936,Painting & Sculpture
16720,Oval with Points,Henry Moore,British,1898.0,1986.0,Male,1968,Painting & Sculpture
16722,The Catboat,Edward Hopper,American,1882.0,1967.0,Male,1922,Prints & Illustrated Books
16724,Plate (page 11) from The Dive,Alex Katz,American,1927.0,NaN,Male,2011,Prints & Illustrated Books

### How to display the entire Data from the DataFrame
We have to set the property for the "max row"

In [19]:
#pd.set_option('display.max_rows', None)
#df

In [20]:
# OR
#pd.set_option("max_rows", None)

### How we can reset the display settings

In [21]:
pd.reset_option("display.max_rows")

### ***How we can reset all the property using the single command***

In [22]:
pd.reset_option("^display") #This command will reset all the display settings

### ***How to get specific column from DataFrame***

In [23]:
df.columns

Index(['Title', 'Artist', 'Nationality', 'BeginDate', 'EndDate', 'Gender',
       'Date', 'Department'],
      dtype='object')

In [24]:
df['Nationality']  # This the series

0                   American
1                    Spanish
2                     French
3                     French
4                     French
                ...
16720                British
16721                Chilean
16722               American
16723    Nationality Unknown
16724               American
Name: Nationality, Length: 16725, dtype: object

#### Want to display more columns

In [25]:
df[['Artist','Department']].head(4)

               Artist                  Department
0  Sarah Charlesworth  Prints & Illustrated Books
1     Pablo Palazuelo  Prints & Illustrated Books
2       Maurice Denis  Prints & Illustrated Books
3    Aristide Maillol  Prints & Illustrated Books

In [26]:
type(df['Nationality'])  # This is the 'Series'

pandas.core.series.Series

In [27]:
type(df[['Artist','Department']])  # This is the DataFrame

pandas.core.frame.DataFrame

In [28]:
# To check all the Data types  
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 16725 entries, 0 to 16724
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Title        16724 non-null  object
 1   Artist       16725 non-null  object
 2   Nationality  16725 non-null  object
 3   BeginDate    15786 non-null  float64
 4   EndDate      10474 non-null  float64
 5   Gender       16725 non-null  object
 6   Date         16725 non-null  int64
 7   Department   16725 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 1.1+ MB

In [29]:
 # To Display only the Data types
df.dtypes

Title           object
Artist          object
Nationality     object
BeginDate      float64
EndDate        float64
Gender          object
Date             int64
Department      object
dtype: object

In [30]:
# To check specific column Data types
df['Gender'].dtypes

dtype('O')

In [31]:
 print(df['Gender'].dtypes)

object

In [32]:
df.describe()

          BeginDate       EndDate          Date
count  15786.000000  10474.000000  16725.000000
mean    1911.905676   1971.210426   1960.391091
std       35.598835     32.212610     30.584037
min     1746.000000   1828.000000   1805.000000
25%     1886.000000   1953.000000   1942.000000
50%     1915.000000   1975.000000   1968.000000
75%     1939.000000   1997.000000   1977.000000
max     2012.000000   2018.000000   2018.000000

In [33]:
df['Nationality'].unique()

array(['American', 'Spanish', 'French', 'South African', 'Canadian',
       'Czech', 'Belgian', 'Russian', 'British', 'German',
       'Nationality Unknown', 'Swiss', 'Polish', 'Japanese', 'Portuguese',
       'Austrian', 'Australian', 'Italian', 'Chilean', 'Colombian',
       'Mexican', 'Brazilian', 'Dutch', 'Romanian', 'Venezuelan',
       'Korean', 'Israeli', 'Argentine', 'Indian', 'Swedish', 'Yugoslav',
       'Cuban', 'Various', 'Luxembourgish', 'Croatian', 'Bulgarian',
       'Hungarian', 'Georgian', 'Puerto Rican', 'Danish', 'Serbian',
       'Pakistani', 'Ecuadorian', 'Chinese', 'Iranian', 'Finnish',
       'Lebanese', 'Thai', 'Cambodian', 'Scottish', 'Kenyan', 'Latvian',
       'Sudanese', 'Uruguayan', 'Peruvian', 'New Zealander', 'Moroccan',
       'Guatemalan', 'Cameroonian', 'Egyptian', 'Nigerian', 'Icelandic',
       'Haitian', 'Tajik', 'Irish', 'Norwegian', 'Costa Rican',
       'Slovenian', 'Turkish', 'Mozambican', 'Palestinian', 'Ukrainian',
       'Angolan', 'Tunisian', 'Greek', 'Zimbabwean', 'Bahamian',
       'Vietnamese', 'Panamanian', 'Canadian Inuit', 'Malian', 'Filipino'],
      dtype=object)

In [34]:
#for i in df['Nationality'].unique():
 print(i)

IndentationError: unexpected indent (1539843764.py, line 2)

In [ ]:
# How to rename the column
df=df.rename(columns = {'Nationality':'Identity'})

In [ ]:
df.head(1)

### ***How to Delete a column***
We can delete the Multiple column,within the List can supply multiple column names.  df2 = df.drop(["EndDate","Date"], axis = 1)

In [ ]:
df1 = df.drop(['BeginDate'],axis= 1)  # There are 2 types of Index in python
                                    # 0 & 1 # axis = "Columns"
                                    # 0 : rows in data frame
                                    # 1 : columns in data frame
# in some case want to delete particular column then use 'inplace=True'.

In [ ]:
df1.head(2)

In [ ]:
df.head(2)

### ***How to Delete Data based on Index***
When want to reflect these changes in the main Dataframe,will use property (inplace = True )

In [ ]:
df1.index.values

In [ ]:
df1.drop([0,2,4,6,8], axis = 0, inplace = True) # axis = 0 represents dealing with the 'rows'

In [ ]:
df1.head()

In [ ]:
df1.reset_index()

### How to change Default INDEX with the help of Dataframe Column
Here we supply "Column name" by which want to change by default index.

In [ ]:
df.set_index("Artist",inplace = True)

In [ ]:
df.head(4)

### How can we access that particular row based on index which is "Artist"

In [ ]:
df.index.get_loc("Pablo Palazuelo") # Using this particular function,can access any of the particular row
                                   # On the second position getting this particular name thats why getting 'True'

In [ ]:
df[df.index.get_loc("Pablo Palazuelo")]  # Getting only the data for that particular index

In [ ]:
df.reset_index(inplace= True)

In [ ]:
df.head(2)

###  Based on Two COlumns, can Set  our Index
***SET  INDEX  BASED  ON  TWO  COLUMNS***

In [ ]:
df.set_index(["Department","Artist"], inplace= True)

In [ ]:
df.head()

In [ ]:
pd.reset_option("^display")

# LOC & ILOC
***Are Dateframe labels, using this we can access dataframe rows and columns***

In [ ]:
df = pd.read_csv("works.csv" , encoding = "UTF -8")
#df

In [ ]:
df.shape

In [ ]:
df.head()

###  iloc works based on "integer index base"
based on interger index accesssing the data, So here we have to specify the ROWS and COLUMN by their INEGER INDEX VALUE

In [ ]:
df.iloc[3] # Here accessing only the row not the column

In [ ]:
df.head()

### How we can select the multiple rows

In [ ]:
# Access second and third row of DataFrame
df.iloc[[2,3]] 
# When using iloc we need specify "Rows and Columns"by their integer index
# If want to access multiple rows then need to provide "List"

In [ ]:
# Using the "Set Index" we can change our by default index
df2 = df.set_index("Artist")
df2.head(2)

In [ ]:
# How can i access that particular row,can access that particualr by their Artist name
df2.iloc['Pablo Palazuelo']

In [ ]:
df2.iloc[2]

In [ ]:
df.head()

In [ ]:
df.iloc[2,3]   # In iloc 'index' start from 'Zero'

In [ ]:
df.iloc[4,7]

In [ ]:
df.iloc[[2,3],:]   # Here colon(:) represent the entire column,if not passing colon 
                  # still got the entire column

## Want all the records with the help of Artist,"Nationality','Gender',

Based on index can access

In [ ]:
df.iloc[:,[1,2,5]]

In [ ]:
df.iloc[[2,4,5],2:5]

When using iloc,we need to pass integer value for accessing the rows & columns.
When using loc, loc is labelled based( we need to specify the name of the rows & columns)Row means whatever your index name (index can be number or string)

In [ ]:
df.loc[5]  # means all the data from the fifth row

In [ ]:
# want to access some specific rows

df.loc[[2,4,5,7]]   # based on the index name u can access that particular rows

### Using loc,How can i get 2 column Artist and Gender

In [ ]:
df.loc[[2,5,7,9,6],['Artist','Gender']]  # in the loc we have to specify the column`s name

## How to apply filter using loc

In [ ]:
df.loc[df['Nationality']=="(Spanish)", :] # Those record that belongs to spanish nationality

In [ ]:
# Want to extract some specific columns

df.loc[df.Nationality =='(American)',"BeginDate":"Department"]

In [ ]:
# If only want two columns 
df.loc[df.Nationality =='(American)',['BeginDate','Date']]